; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v3)
             (pred_10 ?v5 ?v7)
             (pred_1 ?v13 ?v7)
             (pred_9 ?v9 ?v13 )
	     (pred_6 ?v13)
             (pred_7 ?v8)
             (pred_3 ?v5)
             (pred_12 ?v7)
             (pred_5 ?v13)
             (pred_4 ?v5)
             (pred_8 ?v13)
             (pred_11 ))



(:action op_4
:parameters (?v6 ?v1 ?v11 ?v2)
:precondition (and (pred_7 ?v6) (pred_7 ?v1) (pred_3 ?v11) (pred_12 ?v2)
          (pred_2 ?v6 ?v1) (pred_10 ?v11 ?v2)
                   (pred_1 ?v1 ?v2) (pred_6 ?v6) 
                   (pred_5 ?v1) (pred_4 ?v11))
:effect (and  (pred_8 ?v1) (not (pred_5 ?v1))))


(:action op_3
:parameters (?v6 ?v4)
:precondition (and (pred_7 ?v6) (pred_7 ?v4)
               (pred_6 ?v6) (pred_2 ?v6 ?v4) (pred_8 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v6))))

(:action op_5
:parameters (?v6 ?v11)
:precondition (and (pred_7 ?v6) (pred_3 ?v11) 
                  (pred_6 ?v6) (pred_9 ?v11 ?v6) (pred_11 ))
:effect (and (pred_4 ?v11)
   (not (pred_9 ?v11 ?v6)) (not (pred_11 ))))


(:action op_1
:parameters (?v6 ?v12 ?v10)
:precondition (and (pred_7 ?v6) (pred_3 ?v12) (pred_3 ?v10)
                  (pred_6 ?v6) (pred_4 ?v10) (pred_9 ?v12 ?v6))
:effect (and (pred_4 ?v12) (pred_9 ?v10 ?v6)
        (not (pred_4 ?v10)) (not (pred_9 ?v12 ?v6))))

(:action op_2
:parameters (?v6 ?v11)
:precondition (and (pred_7 ?v6) (pred_3 ?v11) 
                  (pred_6 ?v6) (pred_4 ?v11))
:effect (and (pred_11 ) (pred_9 ?v11 ?v6) (not (pred_4 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_28 obj_29 obj_30 obj_04 obj_07 obj_20 obj_16 obj_21 obj_14 obj_22 obj_11 obj_03 obj_08 obj_05 obj_09 obj_15 obj_24 obj_06 obj_27 obj_02 obj_23 obj_25 obj_13 obj_19
    obj_10 obj_26
    obj_18 obj_17 obj_12
    )

    (:init
       (pred_11)

       (pred_7 obj_01)
       (pred_7 obj_28)
       (pred_7 obj_29)
       (pred_7 obj_30)
       (pred_7 obj_04)
       (pred_7 obj_07)
       (pred_7 obj_20)
       (pred_7 obj_16)
       (pred_7 obj_21)
       (pred_7 obj_14)
       (pred_7 obj_22)
       (pred_7 obj_11)
       (pred_7 obj_03)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_7 obj_09)
       (pred_7 obj_15)
       (pred_7 obj_24)
       (pred_7 obj_06)
       (pred_7 obj_27)
       (pred_7 obj_02)
       (pred_7 obj_23)
       (pred_7 obj_25)
       (pred_7 obj_13)
       (pred_7 obj_19)
       (pred_12 obj_10)
       (pred_12 obj_26)
       (pred_3 obj_18)
       (pred_3 obj_17)
       (pred_3 obj_12)

       (pred_2 obj_01 obj_07)
       (pred_2 obj_01 obj_28)
       (pred_2 obj_28 obj_20)
       (pred_2 obj_28 obj_29)
       (pred_2 obj_28 obj_01)
       (pred_2 obj_29 obj_16)
       (pred_2 obj_29 obj_30)
       (pred_2 obj_29 obj_28)
       (pred_2 obj_30 obj_21)
       (pred_2 obj_30 obj_04)
       (pred_2 obj_30 obj_29)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_04 obj_30)
       (pred_2 obj_07 obj_22)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_20 obj_16)
       (pred_2 obj_20 obj_28)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_16 obj_03)
       (pred_2 obj_16 obj_21)
       (pred_2 obj_16 obj_29)
       (pred_2 obj_16 obj_20)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_21 obj_14)
       (pred_2 obj_21 obj_30)
       (pred_2 obj_21 obj_16)
       (pred_2 obj_14 obj_05)
       (pred_2 obj_14 obj_04)
       (pred_2 obj_14 obj_21)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_22 obj_11)
       (pred_2 obj_22 obj_07)
       (pred_2 obj_11 obj_15)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_11 obj_22)
       (pred_2 obj_03 obj_24)
       (pred_2 obj_03 obj_08)
       (pred_2 obj_03 obj_16)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_08 obj_06)
       (pred_2 obj_08 obj_05)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_08 obj_03)
       (pred_2 obj_05 obj_27)
       (pred_2 obj_05 obj_14)
       (pred_2 obj_05 obj_08)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_09 obj_15)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_15 obj_23)
       (pred_2 obj_15 obj_24)
       (pred_2 obj_15 obj_11)
       (pred_2 obj_15 obj_09)
       (pred_2 obj_24 obj_25)
       (pred_2 obj_24 obj_06)
       (pred_2 obj_24 obj_03)
       (pred_2 obj_24 obj_15)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_06 obj_27)
       (pred_2 obj_06 obj_08)
       (pred_2 obj_06 obj_24)
       (pred_2 obj_27 obj_19)
       (pred_2 obj_27 obj_05)
       (pred_2 obj_27 obj_06)
       (pred_2 obj_02 obj_23)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_23 obj_25)
       (pred_2 obj_23 obj_15)
       (pred_2 obj_23 obj_02)
       (pred_2 obj_25 obj_13)
       (pred_2 obj_25 obj_24)
       (pred_2 obj_25 obj_23)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_13 obj_25)
       (pred_2 obj_19 obj_27)
       (pred_2 obj_19 obj_13)
       (pred_5 obj_04)
       (pred_5 obj_20)
       (pred_5 obj_25)
       (pred_1  obj_04 obj_10)
       (pred_1  obj_20 obj_26)
       (pred_1  obj_25 obj_26)
       (pred_8 obj_01)
       (pred_8 obj_28)
       (pred_8 obj_29)
       (pred_8 obj_30)
       (pred_8 obj_07)
       (pred_8 obj_16)
       (pred_8 obj_21)
       (pred_8 obj_14)
       (pred_8 obj_22)
       (pred_8 obj_11)
       (pred_8 obj_03)
       (pred_8 obj_08)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_15)
       (pred_8 obj_24)
       (pred_8 obj_06)
       (pred_8 obj_27)
       (pred_8 obj_02)
       (pred_8 obj_23)
       (pred_8 obj_13)
       (pred_8 obj_19)

       (pred_10  obj_18 obj_10)
       (pred_10  obj_17 obj_26)
       (pred_10  obj_12 obj_26)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_17 obj_21)
       (pred_9 obj_12 obj_24)
       (pred_6 obj_16)
    )

    (:goal (and
       (pred_9 obj_18 obj_19)
       (pred_9 obj_17 obj_29)
    ))
(:constraints
  (always (not (pred_6 obj_30)))
)
)

; plan
1. (op_3 obj_16 obj_21)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_21)
   goals met: 0 of 2
2. (op_5 obj_21 obj_17)
   deleted: (pred_9 obj_17 obj_21) (pred_11)
   added: (pred_4 obj_17)
   goals met: 0 of 2
3. (op_3 obj_21 obj_16)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_16)
   goals met: 0 of 2
4. (op_3 obj_16 obj_29)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_29)
   goals met: 0 of 2
5. (op_2 obj_29 obj_17)
   deleted: (pred_4 obj_17)
   added: (pred_11) (pred_9 obj_17 obj_29)
   goals met: 1 of 2
6. (op_3 obj_29 obj_28)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_28)
   goals met: 1 of 2
7. (op_3 obj_28 obj_01)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_01)
   goals met: 1 of 2
8. (op_5 obj_01 obj_18)
   deleted: (pred_9 obj_18 obj_01) (pred_11)
   added: (pred_4 obj_18)
   goals met: 1 of 2
9. (op_3 obj_01 obj_28)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_28)
   goals met: 1 of 2
10. (op_3 obj_28 obj_29)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_29)
   goals met: 1 of 2
11. (op_3 obj_29 obj_16)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_16)
   goals met: 1 of 2
12. (op_3 obj_16 obj_21)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_21)
   goals met: 1 of 2
13. (op_3 obj_21 obj_14)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_14)
   goals met: 1 of 2
14. (op_3 obj_14 obj_05)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_05)
   goals met: 1 of 2
15. (op_3 obj_05 obj_27)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_27)
   goals met: 1 of 2
16. (op_3 obj_27 obj_19)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_19)
   goals met: 1 of 2
17. (op_2 obj_19 obj_18)
   deleted: (pred_4 obj_18)
   added: (pred_11) (pred_9 obj_18 obj_19)
   goals met: 2 of 2
